{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm0_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm0_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_6", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm1_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm1_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_11", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm2_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm2_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_2", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_3", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_16", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm3_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm3_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_3", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_4", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_21", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm4_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm4_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_4", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_5", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_26", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm5_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm5_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_5", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_6", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_31", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm6_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm6_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_6", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad7", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_5", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_36", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm7_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm7_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip7", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_7", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad8", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_7", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_41", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm8_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm8_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip8", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_8", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad9", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_8", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_46", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm9_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm9_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip9", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_9", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad10", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_9", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_51", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm10_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm10_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip10", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_10", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad11", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_8", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_56", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm11_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm11_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip11", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_11", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0], [58, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad12", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_10", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_61", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm12_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm12_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip12", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_12", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad13", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_11", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_66", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm13_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm13_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip13", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_13", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[66, 0, 0], [67, 0, 0], [68, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad14", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_12", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[70, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_71", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm14_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm14_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip14", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_14", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[71, 0, 0], [72, 0, 0], [73, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad15", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_11", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_76", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm15_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm15_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip15", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_13", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[76, 0, 0], [77, 0, 0], [78, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad16", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_12", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_81", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm16_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm16_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip16", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_14", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[81, 0, 0], [82, 0, 0], [83, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad17", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_11", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_86", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm17_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm17_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip17", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_13", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad18", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_12", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_91", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm18_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm18_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip18", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_14", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[91, 0, 0], [92, 0, 0], [93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad19", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_11", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_96", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm19_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm19_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip19", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_13", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[96, 0, 0], [97, 0, 0], [98, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad20", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_12", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_101", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm20_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm20_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip20", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_14", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[101, 0, 0], [102, 0, 0], [103, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad21", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_11", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_106", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm21_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm21_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip21", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_13", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[106, 0, 0], [107, 0, 0], [108, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad22", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_12", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_111", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm22_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm22_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip22", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_14", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[111, 0, 0], [112, 0, 0], [113, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad23", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_11", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_116", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm23_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm23_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip23", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_15", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[116, 0, 0], [117, 0, 0], [118, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad24", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_13", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_121", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm24_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm24_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip24", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_16", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[121, 0, 0], [122, 0, 0], [123, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad25", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_14", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[125, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_126", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm25_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm25_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip25", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_17", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[126, 0, 0], [127, 0, 0], [128, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad26", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_15", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_131", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm26_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm26_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "clip26", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_clip_18", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[131, 0, 0], [132, 0, 0], [133, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "global_avg_pool2d0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_global_avg_pool2d", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[135, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad27", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_transpose_flatten_reshape_pad", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_136", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_137", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d27", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[137, 0, 0], [138, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "softmax0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_softmax", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[140, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_reshape", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[141, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    4, 
    7, 
    8, 
    9, 
    12, 
    13, 
    14, 
    17, 
    18, 
    19, 
    22, 
    23, 
    24, 
    27, 
    28, 
    29, 
    32, 
    33, 
    34, 
    37, 
    38, 
    39, 
    42, 
    43, 
    44, 
    47, 
    48, 
    49, 
    52, 
    53, 
    54, 
    57, 
    58, 
    59, 
    62, 
    63, 
    64, 
    67, 
    68, 
    69, 
    72, 
    73, 
    74, 
    77, 
    78, 
    79, 
    82, 
    83, 
    84, 
    87, 
    88, 
    89, 
    92, 
    93, 
    94, 
    97, 
    98, 
    99, 
    102, 
    103, 
    104, 
    107, 
    108, 
    109, 
    112, 
    113, 
    114, 
    117, 
    118, 
    119, 
    122, 
    123, 
    124, 
    127, 
    128, 
    129, 
    132, 
    133, 
    134, 
    138, 
    139
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    124, 
    125, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    135, 
    136, 
    137, 
    138, 
    139, 
    140, 
    141, 
    142, 
    143
  ], 
  "heads": [[142, 0, 0]], 
  "attrs": {
    "storage_id": ["list_int", [
        6, 
        0, 
        7, 
        8, 
        9, 
        1, 
        0, 
        10, 
        11, 
        12, 
        1, 
        0, 
        13, 
        14, 
        15, 
        1, 
        0, 
        16, 
        17, 
        18, 
        1, 
        0, 
        19, 
        20, 
        21, 
        1, 
        0, 
        22, 
        23, 
        24, 
        1, 
        0, 
        25, 
        26, 
        27, 
        1, 
        0, 
        28, 
        29, 
        30, 
        1, 
        0, 
        31, 
        32, 
        33, 
        1, 
        0, 
        34, 
        35, 
        36, 
        1, 
        0, 
        37, 
        38, 
        39, 
        1, 
        0, 
        40, 
        41, 
        42, 
        1, 
        2, 
        43, 
        44, 
        45, 
        1, 
        0, 
        46, 
        47, 
        48, 
        1, 
        0, 
        49, 
        50, 
        51, 
        1, 
        0, 
        52, 
        53, 
        54, 
        1, 
        0, 
        55, 
        56, 
        57, 
        1, 
        0, 
        58, 
        59, 
        60, 
        1, 
        0, 
        61, 
        62, 
        63, 
        1, 
        0, 
        64, 
        65, 
        66, 
        1, 
        0, 
        67, 
        68, 
        69, 
        1, 
        0, 
        70, 
        71, 
        72, 
        1, 
        0, 
        73, 
        74, 
        75, 
        1, 
        0, 
        76, 
        77, 
        78, 
        2, 
        3, 
        79, 
        80, 
        81, 
        2, 
        1, 
        82, 
        83, 
        84, 
        2, 
        1, 
        85, 
        86, 
        87, 
        2, 
        3, 
        2, 
        88, 
        89, 
        4, 
        5, 
        4]], 
    "dtype": ["list_int", [
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0]], 
    "dltype": ["list_str", [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"]], 
    "shape": ["list_shape", [
        [1, 3, 128, 128], 
        [1, 3, 130, 130], 
        [32, 3, 3, 3], 
        [32, 1, 1], 
        [32, 1, 1], 
        [1, 32, 64, 64], 
        [1, 32, 66, 66], 
        [32, 1, 3, 3], 
        [32, 1, 1], 
        [32, 1, 1], 
        [1, 32, 64, 64], 
        [1, 32, 64, 64], 
        [64, 32, 1, 1], 
        [64, 1, 1], 
        [64, 1, 1], 
        [1, 64, 64, 64], 
        [1, 64, 66, 66], 
        [64, 1, 3, 3], 
        [64, 1, 1], 
        [64, 1, 1], 
        [1, 64, 32, 32], 
        [1, 64, 32, 32], 
        [128, 64, 1, 1], 
        [128, 1, 1], 
        [128, 1, 1], 
        [1, 128, 32, 32], 
        [1, 128, 34, 34], 
        [128, 1, 3, 3], 
        [128, 1, 1], 
        [128, 1, 1], 
        [1, 128, 32, 32], 
        [1, 128, 32, 32], 
        [128, 128, 1, 1], 
        [128, 1, 1], 
        [128, 1, 1], 
        [1, 128, 32, 32], 
        [1, 128, 34, 34], 
        [128, 1, 3, 3], 
        [128, 1, 1], 
        [128, 1, 1], 
        [1, 128, 16, 16], 
        [1, 128, 16, 16], 
        [256, 128, 1, 1], 
        [256, 1, 1], 
        [256, 1, 1], 
        [1, 256, 16, 16], 
        [1, 256, 18, 18], 
        [256, 1, 3, 3], 
        [256, 1, 1], 
        [256, 1, 1], 
        [1, 256, 16, 16], 
        [1, 256, 16, 16], 
        [256, 256, 1, 1], 
        [256, 1, 1], 
        [256, 1, 1], 
        [1, 256, 16, 16], 
        [1, 256, 18, 18], 
        [256, 1, 3, 3], 
        [256, 1, 1], 
        [256, 1, 1], 
        [1, 256, 8, 8], 
        [1, 256, 8, 8], 
        [512, 256, 1, 1], 
        [512, 1, 1], 
        [512, 1, 1], 
        [1, 512, 8, 8], 
        [1, 512, 10, 10], 
        [512, 1, 3, 3], 
        [512, 1, 1], 
        [512, 1, 1], 
        [1, 512, 8, 8], 
        [1, 512, 8, 8], 
        [512, 512, 1, 1], 
        [512, 1, 1], 
        [512, 1, 1], 
        [1, 512, 8, 8], 
        [1, 512, 10, 10], 
        [512, 1, 3, 3], 
        [512, 1, 1], 
        [512, 1, 1], 
        [1, 512, 8, 8], 
        [1, 512, 8, 8], 
        [512, 512, 1, 1], 
        [512, 1, 1], 
        [512, 1, 1], 
        [1, 512, 8, 8], 
        [1, 512, 10, 10], 
        [512, 1, 3, 3], 
        [512, 1, 1], 
        [512, 1, 1], 
        [1, 512, 8, 8], 
        [1, 512, 8, 8], 
        [512, 512, 1, 1], 
        [512, 1, 1], 
        [512, 1, 1], 
        [1, 512, 8, 8], 
        [1, 512, 10, 10], 
        [512, 1, 3, 3], 
        [512, 1, 1], 
        [512, 1, 1], 
        [1, 512, 8, 8], 
        [1, 512, 8, 8], 
        [512, 512, 1, 1], 
        [512, 1, 1], 
        [512, 1, 1], 
        [1, 512, 8, 8], 
        [1, 512, 10, 10], 
        [512, 1, 3, 3], 
        [512, 1, 1], 
        [512, 1, 1], 
        [1, 512, 8, 8], 
        [1, 512, 8, 8], 
        [512, 512, 1, 1], 
        [512, 1, 1], 
        [512, 1, 1], 
        [1, 512, 8, 8], 
        [1, 512, 10, 10], 
        [512, 1, 3, 3], 
        [512, 1, 1], 
        [512, 1, 1], 
        [1, 512, 4, 4], 
        [1, 512, 4, 4], 
        [1024, 512, 1, 1], 
        [1024, 1, 1], 
        [1024, 1, 1], 
        [1, 1024, 4, 4], 
        [1, 1024, 6, 6], 
        [1024, 1, 3, 3], 
        [1024, 1, 1], 
        [1024, 1, 1], 
        [1, 1024, 4, 4], 
        [1, 1024, 4, 4], 
        [1024, 1024, 1, 1], 
        [1024, 1, 1], 
        [1024, 1, 1], 
        [1, 1024, 4, 4], 
        [1, 1024, 1, 1], 
        [1, 1024, 1, 1], 
        [2, 1024, 1, 1], 
        [2], 
        [1, 2, 1, 1], 
        [1, 2, 1, 1], 
        [1, 2]]]
  }
}