{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_2", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "max_pool2d0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_max_pool2d", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_3", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_4", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu_1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_5", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_6", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu_2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_7", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_8", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu_3", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "concatenate0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_concatenate", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[10, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_9", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_10", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu_4", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_11", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_12", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu_2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_13", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_14", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu_3", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "concatenate1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_concatenate", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[21, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "max_pool2d1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_max_pool2d_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_15", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_16", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu7", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu_5", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_17", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_18", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu8", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu_6", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_19", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_20", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu9", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu_7", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "concatenate2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_concatenate_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[33, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_21", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_22", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu10", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu_8", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[38, 0, 0], [39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_23", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_24", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu11", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu_6", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_25", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_26", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu12", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu_7", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[45, 0, 0], [46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "concatenate3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_concatenate_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[44, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "max_pool2d2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_max_pool2d_2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_27", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_28", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu13", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu_9", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[50, 0, 0], [51, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_29", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_30", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu14", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu_10", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[53, 0, 0], [54, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_31", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_32", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu15", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu_11", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[57, 0, 0], [58, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "concatenate4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_concatenate_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[56, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_33", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_34", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu16", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu_12", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_35", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_36", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu17", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu_10", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[64, 0, 0], [65, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_37", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_38", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu18", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu_11", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[68, 0, 0], [69, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "concatenate5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_concatenate_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[67, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_39", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_40", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu19", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu_13", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_41", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_42", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu20", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu_14", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_3", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_43", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_44", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu21", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu_15", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[79, 0, 0], [80, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "concatenate6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_concatenate_3", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[78, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_45", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_46", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu22", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu_16", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[83, 0, 0], [84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_47", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_48", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu23", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu_14", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad7", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_3", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_49", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_50", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu24", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu_15", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[90, 0, 0], [91, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "concatenate7", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_concatenate_3", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[89, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_param_51", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_param_52", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu25", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_relu_17", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[94, 0, 0], [95, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "global_avg_pool2d0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_global_avg_pool2d", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[97, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_transpose_flatten", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[98, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "softmax0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_softmax", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[99, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    5, 
    6, 
    8, 
    9, 
    12, 
    13, 
    16, 
    17, 
    19, 
    20, 
    23, 
    24, 
    28, 
    29, 
    31, 
    32, 
    35, 
    36, 
    39, 
    40, 
    42, 
    43, 
    46, 
    47, 
    51, 
    52, 
    54, 
    55, 
    58, 
    59, 
    62, 
    63, 
    65, 
    66, 
    69, 
    70, 
    73, 
    74, 
    76, 
    77, 
    80, 
    81, 
    84, 
    85, 
    87, 
    88, 
    91, 
    92, 
    95, 
    96
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101
  ], 
  "heads": [[100, 0, 0]], 
  "attrs": {
    "storage_id": ["list_int", [
        7, 
        8, 
        9, 
        0, 
        1, 
        10, 
        11, 
        2, 
        12, 
        13, 
        1, 
        0, 
        14, 
        15, 
        2, 
        0, 
        16, 
        17, 
        1, 
        18, 
        19, 
        2, 
        0, 
        20, 
        21, 
        1, 
        0, 
        2, 
        22, 
        23, 
        1, 
        24, 
        25, 
        2, 
        3, 
        26, 
        27, 
        1, 
        0, 
        28, 
        29, 
        3, 
        30, 
        31, 
        2, 
        1, 
        32, 
        33, 
        0, 
        1, 
        2, 
        34, 
        35, 
        3, 
        36, 
        37, 
        1, 
        2, 
        38, 
        39, 
        3, 
        2, 
        40, 
        41, 
        3, 
        42, 
        43, 
        1, 
        2, 
        44, 
        45, 
        3, 
        2, 
        46, 
        47, 
        3, 
        48, 
        49, 
        1, 
        2, 
        50, 
        51, 
        3, 
        2, 
        52, 
        53, 
        3, 
        54, 
        55, 
        1, 
        2, 
        56, 
        57, 
        3, 
        2, 
        58, 
        59, 
        4, 
        5, 
        6, 
        5]], 
    "dtype": ["list_int", [
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0]], 
    "dltype": ["list_str", [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"]], 
    "shape": ["list_shape", [
        [1, 3, 128, 128], 
        [64, 3, 3, 3], 
        [64], 
        [1, 64, 63, 63], 
        [1, 64, 31, 31], 
        [16, 64, 1, 1], 
        [16], 
        [1, 16, 31, 31], 
        [64, 16, 1, 1], 
        [64], 
        [1, 64, 31, 31], 
        [1, 16, 33, 33], 
        [64, 16, 3, 3], 
        [64], 
        [1, 64, 31, 31], 
        [1, 128, 31, 31], 
        [16, 128, 1, 1], 
        [16], 
        [1, 16, 31, 31], 
        [64, 16, 1, 1], 
        [64], 
        [1, 64, 31, 31], 
        [1, 16, 33, 33], 
        [64, 16, 3, 3], 
        [64], 
        [1, 64, 31, 31], 
        [1, 128, 31, 31], 
        [1, 128, 15, 15], 
        [32, 128, 1, 1], 
        [32], 
        [1, 32, 15, 15], 
        [128, 32, 1, 1], 
        [128], 
        [1, 128, 15, 15], 
        [1, 32, 17, 17], 
        [128, 32, 3, 3], 
        [128], 
        [1, 128, 15, 15], 
        [1, 256, 15, 15], 
        [32, 256, 1, 1], 
        [32], 
        [1, 32, 15, 15], 
        [128, 32, 1, 1], 
        [128], 
        [1, 128, 15, 15], 
        [1, 32, 17, 17], 
        [128, 32, 3, 3], 
        [128], 
        [1, 128, 15, 15], 
        [1, 256, 15, 15], 
        [1, 256, 7, 7], 
        [48, 256, 1, 1], 
        [48], 
        [1, 48, 7, 7], 
        [192, 48, 1, 1], 
        [192], 
        [1, 192, 7, 7], 
        [1, 48, 9, 9], 
        [192, 48, 3, 3], 
        [192], 
        [1, 192, 7, 7], 
        [1, 384, 7, 7], 
        [48, 384, 1, 1], 
        [48], 
        [1, 48, 7, 7], 
        [192, 48, 1, 1], 
        [192], 
        [1, 192, 7, 7], 
        [1, 48, 9, 9], 
        [192, 48, 3, 3], 
        [192], 
        [1, 192, 7, 7], 
        [1, 384, 7, 7], 
        [64, 384, 1, 1], 
        [64], 
        [1, 64, 7, 7], 
        [256, 64, 1, 1], 
        [256], 
        [1, 256, 7, 7], 
        [1, 64, 9, 9], 
        [256, 64, 3, 3], 
        [256], 
        [1, 256, 7, 7], 
        [1, 512, 7, 7], 
        [64, 512, 1, 1], 
        [64], 
        [1, 64, 7, 7], 
        [256, 64, 1, 1], 
        [256], 
        [1, 256, 7, 7], 
        [1, 64, 9, 9], 
        [256, 64, 3, 3], 
        [256], 
        [1, 256, 7, 7], 
        [1, 512, 7, 7], 
        [2, 512, 1, 1], 
        [2], 
        [1, 2, 7, 7], 
        [1, 2, 1, 1], 
        [1, 2], 
        [1, 2]]]
  }
}